import numpy as np
import matplotlib.pyplot as plt

pier_positions = np.array([
            [904.6367455, 1983.85201],
            [1529.108235, 1504.268175],
            [1660.172983, 1407.708453],
            [2548.682218, 4460.930873],
            [3869.961073, 3377.928421],
            [4374.625395, 7076.262667],
            [5086.475821, 6594.347355],
            [5798.293632, 6112.432366],
            [5218.089009, 8879.540071],
            [5339.494183, 8801.271574],
            [5460.997113, 8722.892224],
            [5582.405801, 8644.623744],
            [5703.816304, 8566.244411],
            [5825.228506, 8487.975948],
            [5946.73847, 8409.596632],
            [6068.154185, 8331.328186],
            [8698.153323, 14880.07622],
            [8791.218583, 14814.66716],
            [8846.385963, 14776.75208],
            [9367.014633, 14394.27549],
            [9486.000621, 14304.6984],
            [9637.70713, 14194.38999],
            [10754.16604, 17507.08645],
            [11281.68388, 17076.49381],
            [11809.24378, 16645.90142],
            [16659.98653, 20888.97713],
            [16706.61213, 20795.1864],
            [17012.44797, 20113.2639],
            [23047.75274, 23318.67112],
            [23403.45659, 22417.45724]
        ])

def main(t, ps_delta_2, ps_rps_2, ss_delta_2, ss_rps_2,
         ned_e, ned_n, ned_heading, motion_u, motion_v, motion_r, ts_ship_list):
    """
    实现算法逻辑

    Parameters
    ----------
    t : int
        当前场景运行时间(s)
    ps_delta_2 : float
        左舵角*(故障修正)
    ps_rps_2 : float
        左转速*
    ss_delta_2 : float
        右舵角*
    ss_rps_2 : float
        右转速*
    ned_e : float
        东向位移(已起始点为0东为正)(m)
    ned_n : float
        北向位移(已起始点为0北为正)(m)
    ned_heading : float
        真航向(已真北方向为0顺时针0-360)(度)
    motion_u : float
        纵荡速度(m/s)
    motion_v : float
        横荡速度(m/s)
    motion_r : float
        艏摇角速度(°/s)
    ts_ship_list : list
        障碍船坐标列表

    Returns
    -------
    ps_delta_1 : float
        左舵角
    ps_rps_1 : float
        左转速
    ss_delta_1 : float
        右舵角
    """
    ps_delta_1=0
    ps_rps_1=0
    ss_delta_1=0
    ss_rps_1=0

    # Your code goes here

    return float(ps_delta_1), float(ps_rps_1), float(ss_delta_1), float(ss_rps_1)
